singles.org
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: .
#+HUGO_WEIGHT: auto

** About me
:PROPERTIES: 
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :resume-path /static/resume.pdf
:EXPORT_FILE_NAME: about-me
:END:

My name is Martin Mariano and I'm a passionate developer interested in
web development, embedded systems and tons of other stuff. I founded
the CS2 marketplace (originally on cs:go)
[[https://mercadoskin.com][MercadoSkin]] and authored some rust open
source projects.

I'm currently living in São Paulo, Brazil and open for work. If you
want to contact me, you can reach me via one of the following
communication channels:

    - via [[mailto:contato@martinmariano.com][email]]
    - find me on [[https://github.com/saskenuba][github]]
    - or [[https://www.linkedin.com/in/martinmariano][linkedIn]]

My usual nickname is saskenuba.

All of the open source stuff I work on is MIT licensed which means you
can do with it whatever you want.

*** About this Website

The website itself is written with org-mode and exported to markdown
using org-hugo.

*** Why saskenuba?

Oh god. I was 12 years old, okay? It is a word play of "Sasuke" (a
character from the Naruto anime) and noob. Yes, I was nerdy (still am,
though).

*** Misc

As of 02-20-2024, I can bench 90kg; squat 117kg and deadlift 140kg. I
was once run over by a motorcycle.


