content/about-me.md
+++
title = "About me"
draft = false
weight = 2001
resume-path = "/static/resume.pdf"
+++

My name is Martin Mariano and I'm a passionate developer interested in
web development, embedded systems and tons of other stuff. I founded
the CS2 marketplace (originally on cs:go)
[MercadoSkin](https://mercadoskin.com) and authored some rust open
source projects.

I'm currently living in São Paulo, Brazil and open for work. If you
want to contact me, you can reach me via one of the following
communication channels:

-   via [email](mailto:contato@martinmariano.com)
-   find me on [github](https://github.com/saskenuba)
-   or [linkedIn](https://www.linkedin.com/in/martinmariano)

My usual nickname is saskenuba.

All of the open source stuff I work on is MIT licensed which means you
can do with it whatever you want.


## About this Website {#about-this-website}

The website itself is written with org-mode and exported to markdown
using org-hugo.


## Why saskenuba? {#why-saskenuba}

Oh god. I was 12 years old, okay? It is a word play of "Sasuke" (a
character from the Naruto anime) and noob. Yes, I was nerdy (still am,
though).


## Misc {#misc}

As of 02-20-2024, I can bench 90kg; squat 117kg and deadlift 140kg. I
was once run over by a motorcycle.
